package Task002;

public class Task002 {
    /**
     *
     Дана строка строки, содержащая только символы '(', ')', '{', '}', '[' и ']', определите, является ли входная строка допустимой.

     Входная строка допустима, если:

     Открытые скобки должны быть закрыты скобками того же типа.
     Открытые скобки должны быть закрыты в правильном порядке.
     Каждая закрывающая скобка имеет соответствующую открытую скобку того же типа.
     */
    public static void main(String[] args) {

    }
}
